# TAPS
tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "mistertea/et"
tap "mutagen-io/mutagen"
tap "romkatv/powerlevel10k"
tap "sdkman/tap"

# BREWS
brew "coreutils"
brew "libyaml"
brew "openssl@1.1"
brew "asdf"
brew "bat"
brew "chezmoi"
brew "curl"
brew "delta"
brew "direnv"
brew "sqlite"
brew "dotbot"
brew "dua-cli"
brew "duf"
brew "exa"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gitui"
brew "go"
brew "graphviz"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "ncurses"
brew "less"
brew "luarocks"
brew "mint"
brew "neofetch"
brew "neovim"
brew "protobuf"
brew "python@3.8"
brew "ranger"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "tig"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "tree-sitter"
brew "unzip"
brew "watch"
brew "wget"
brew "yq"
brew "zip"
brew "zsh"
brew "zsh-autosuggestions"
brew "amazon/amazon/env-improvement"
brew "amazon/amazon/ninja-dev-sync"
brew "aws/tap/aws-sam-cli"
brew "mutagen-io/mutagen/mutagen"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "sdkman/tap/sdkman-cli"

# CASKS
cask "1password"
cask "android-platform-tools"
cask "appcleaner"
cask "discord"
cask "element"
cask "figma"
cask "firefox"
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "fork"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kap"
cask "keepingyouawake"
cask "kitty"
cask "neovide"
cask "obs"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "slack"
cask "spotify"
cask "stretchly"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "xcodes"
cask "zoom"
