tap "aws/tap"
tap "creedasaurus/gprox"
tap "homebrew/bundle"
tap "homebrew/core"
tap "mistertea/et"
tap "mutagen-io/mutagen"
tap "romkatv/powerlevel10k"
tap "sdkman/tap"
brew "gcc"
brew "perl"
brew "asdf"
brew "libxml2"
brew "file-formula"
brew "libffi"
brew "libtirpc"
brew "libnsl"
brew "python@3.10"
brew "glib"
brew "libgit2"
brew "openssl@3"
brew "shared-mime-info"
brew "zsh-syntax-highlighting"
brew "aws/tap/aws-sam-cli"
brew "creedasaurus/gprox/gprox"
brew "sdkman/tap/sdkman-cli"
