
tap "1password/tap"
tap "buildpacks/tap"
tap "bufbuild/buf"
tap "confluentinc/tap"
tap "creedasaurus/gprox"
tap "dagger/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "kcl-lang/tap"
tap "koekeishiya/formulae"
tap "redpanda-data/tap"
tap "sdkman/tap"
tap "turbot/tap"
tap "warrensbox/tap"
tap "substrate/tap", "git@github.ol.epicgames.net:substrate/homebrew-tap.git"

# BREW packages

brew "atuin" # Shell history sync and stats
brew "awscli@2" # AWS cli
brew "bat" # a better 'cat'
brew "bottom" # HTOP alternative
brew "broot" # file/folder navigation CLI TUI
brew "btop" # another HTOP alternative
brew "buildpacks/tap/pack" # buildpacks
brew "bufbuild/buf/buf" # proto gen cli tool
brew "caddy" # awesome webserver w/ auto HTTPS
brew "chezmoi" # Dotfiles manager!
brew "colima" # docker alternative
brew "confluentinc/tap/cli" # confluent (work)
brew "croc" # scp alternative
brew "curl"
brew "d2" # diagrams as code tool
brew "dagger/tap/dagger" # dagger CI cli tool
brew "deno" # another JS/TS runtime
brew "derailed/k9s/k9s" # Kubernetes cli dashboard tool
brew "doggo" # a better DNS tool, dig alternative
brew "dua-cli" # disk usage analyzer
brew "duf" # a better `df`
brew "dust" # a better `du`
brew "fd" # a better `find`
brew "git-delta" # best git diff ever
brew "gradle-completion" # gradle zsh completions
brew "hashicorp/tap/packer" # create vm images
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "helm" # k8s package manager
brew "kcl-lang/tap/kcl" # new config validation language
brew "kcl-lang/tap/kcl-lsp" # LSP for that ^
brew "krew" # kubectl plugin manager
brew "luarocks" # lua dependencies?
brew "mint" # macos Swift tool package manager?
brew "mise" # dir-based language runtime shim tool
brew "openssl"
brew "redpanda-data/tap/redpanda" # kafka and connect alternative
brew "steampipe" # query all the cloud things!
brew "substrate/tap/aop" # EPIC GAMES cloud setup tool
brew "substrate/tap/ixm" # EPIC GAMES network management tool
brew "trash" # safe 'rm' tool
brew "uv" # python package manager thing?
brew "warrensbox/tap/tfswitch" # switch Terraform versions based on project
brew "zlib"
brew "zsh"

# CASKS

cask "1password"
cask "1password-cli"
cask "activitywatch" # cool local-only activity time tracker
cask "alacritty" # terminal emulator
cask "android-platform-tools" # android tools
cask "appcleaner" # super-delete apps tool
cask "balenaetcher" # USB iso flasher
cask "brave-browser" # browser
cask "bruno" # API testing tool
cask "chromedriver" # remote control chrome (integ test thing)
cask "darktable" # open-source Lightroom alternative
cask "dbeaver-community" # Database query tool
cask "discord" # chat
cask "element" # chat
cask "figma" # design tool
cask "finch" # Docker alternative
cask "firefox" # browser
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono-nerd-font" # <- most used font currently
cask "font-mononoki-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "fork" # awesome git tool
cask "ghostty" # <- most used terminal emulator
cask "hammerspoon" # shortcut creator? Haven't used much.
cask "iterm2" # terminal emulator
cask "jetbrains-toolbox" # install all the Jetbrains stuff
cask "kap" # screen-cap utility
cask "karabiner-elements" # keyboard remapping tool
cask "keepingyouawake" # keep computer from sleeping
cask "microsoft-edge" # browser
cask "obs" # streaming software
cask "obsidian" # note taking stuff
cask "postman" # api testing tool
cask "raspberry-pi-imager" # create images for pi
cask "raycast" # <- replace default Spotlight search :thumbs_up:
cask "rectangle" # Screen snapping shortcut tool
cask "scroll-reverser" # Reverse scroll on trackpad vs mouse
cask "spotify" # music
cask "stretchly" # get up and look away from screen periodically
cask "sublime-text" # text editor
cask "tuist" # iOS project helper thing
cask "visual-studio-code" # code editor
cask "visualvm" # JVM debugging tool
cask "vlc" # play any content ever
cask "wezterm" # terminal emulator (2nd place to Ghostty right now)
cask "xcodes" # manage xcode installations
cask "zed" # cool editor, but not quite there

# VSCODE plugins

vscode "amazonwebservices.aws-toolkit-vscode"
vscode "castwide.solargraph"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "redhat.vscode-yaml"
vscode "yoavbls.pretty-ts-errors"
