
tap "1password/tap"
tap "buildpacks/tap"
tap "bufbuild/buf"
tap "confluentinc/tap"
tap "creedasaurus/gprox"
tap "dagger/tap"
tap "MisterTea/et"
tap "derailed/k9s"
tap "go-task/tap"
tap "hashicorp/tap"
tap "mike-engel/jwt-cli"
tap "kcl-lang/tap"
tap "localstack/tap"
tap "nats-io/nats-tools"
tap "redpanda-data/tap"
tap "robusta-dev/homebrew-krr"
tap "sdkman/tap"
tap "quarkusio/tap"
tap "sourcegraph/src-cli"
tap "turbot/tap" # steampipe tap
tap "warrensbox/tap"
tap "substrate/tap", "git@github.ol.epicgames.net:substrate/homebrew-tap.git"

# BREW packages

brew "autoconf-archive"
brew "automake"
brew "atuin" # Shell history sync and stats
brew "awscli@2" # AWS cli
brew "bat" # a better 'cat'
brew "bfs" # breadth-first version of find
brew "bottom" # HTOP alternative
brew "broot" # file/folder navigation CLI TUI
brew "btop" # another HTOP alternative
brew "buildpacks/tap/pack" # buildpacks
brew "bufbuild/buf/buf" # proto gen cli tool
brew "caddy" # awesome webserver w/ auto HTTPS
brew "chezmoi" # Dotfiles manager!
brew "ccache"              # compiler cache
brew "cmake"
brew "colima" # docker alternative
brew "confluentinc/tap/cli" # confluent (work)
brew "croc" # scp alternative
brew "curl"
brew "d2" # diagrams as code tool
brew "dagger/tap/dagger" # dagger CI cli tool
brew "deno" # another JS/TS runtime
brew "dive" # docker image explorer
brew "docker"
brew "docker-compose"
brew "doggo" # a better DNS tool, dig alternative
brew "dprint"              # pluggable code formatter
brew "dos2unix" # convert line endings
brew "dua-cli" # disk usage analyzer
brew "duckdb" # query ALL the things
brew "duf" # a better `df`
brew "dust" # a better `du`
brew "MisterTea/et/et" # eternal terminal
brew "fastmod" # codemod alternative
brew "fd" # a better `find`
brew "ffmpeg"
brew "fswatch" # file system watcher
brew "fpp" # file path picker
brew "fx" # JSON viewer
brew "fzf" # fuzzy finder
brew "gawk"
brew "gh" # GitHub CLI
brew "git"
brew "git-delta" # best git diff ever
brew "git-filter-repo"     # git history rewriting
brew "gitui" # git TUI
brew "git-lfs"
brew "gnupg"
brew "gnu-sed"
brew "golangci-lint"
brew "googleworkspace-cli"
brew "graphviz"
brew "grafanactl" # grafana cli
brew "go-task/tap/go-task" # task runner
brew "gradle-completion" # gradle zsh completions
brew "hadolint"            # Dockerfile linter
brew "harbor-cli"          # Harbor registry CLI
brew "hashicorp/tap/packer" # create vm images
# brew "hashicorp/tap/terraform", link: false
brew "hashicorp/tap/vault"
brew "helix" # interesting vim-like editor
brew "helm" # k8s package manager
brew "htop"
brew "hyperfine" # benchmarking tool
brew "imagemagick"
brew "jaq" # jq alternative for correctness
brew "jdtls"               # Java LSP
brew "jfrog-cli"           # JFrog Artifactory CLI
brew "jc" # JSON config file CLI parser
brew "jj" # jujutsu vcs
brew "jq" # THE json cli parser
brew "just" # just another task runner
brew "mike-engel/jwt-cli/jwt-cli" # JWT cli tool
brew "k6"
brew "derailed/k9s/k9s" # Kubernetes cli dashboard tool
brew "kcl-lang/tap/kcl" # new config validation language
brew "kcl-lang/tap/kcl-lsp" # LSP for that ^
brew "ko"                  # Go container image builder
brew "kondo" # project cleanup tool
brew "krew" # kubectl plugin manager
brew "quarkusio/tap/quarkus"
brew "robusta-dev/homebrew-krr/krr" # k8s resource recommendations
brew "kustomize"
brew "lazygit" # git TUI
brew "less"
brew "localstack/tap/localstack-cli" # local AWS stack
brew "lolcat" # colorized cat
brew "llvm"                # LLVM toolchain
brew "lua-language-server" # Lua LSP
brew "luarocks" # lua dependencies?
brew "lsd" # a better `ls`
brew "minikube"
brew "mint" # macos Swift tool package manager?
brew "mise" # dir-based language runtime shim tool
brew "mosh" # stay-connect SSH
brew "nasm"                # assembler
brew "nats-io/nats-tools/nats"
brew "ninja"               # build system
brew "neofetch"
brew "neovim"
brew "netcat"
brew "nmap"
brew "nushell" # a totally amazing shell
brew "carapace" # multi-shell completion engine
brew "oha" # HTTP load tester
brew "openssl"
brew "opentofu" # terraform alternative
brew "pdfcpu" # PDF manipulation tool
brew "pkgconf"
brew "pipes-sh" # pipes in your terminal
brew "poppler" # PDF rendering lib
brew "protobuf"
brew "ripgrep"
brew "rclone"
brew "rsync"
brew "rustscan"
brew "redpanda-data/tap/redpanda" # kafka and connect alternative
brew "scc" # LOC counter
brew "skopeo" # remote OCI image helper
brew "sevenzip" # 7zip
brew "shfmt" # shell formatter
brew "steampipe" # query all the cloud things!
brew "sqlite"
brew "sourcegraph/src-cli/src-cli" # sourcegraph cli
brew "substrate/tap/aop" # EPIC GAMES cloud setup tool
brew "starship" # shell prompt
brew "stern" # k8s log viewer
brew "tealdeer" # tldr alternative
brew "terraform-docs"      # generate docs from Terraform modules
brew "tflint"              # Terraform linter
brew "tig" # git TUI
brew "tmux"
brew "tokei" # code line counter
brew "trash" # safe 'rm' tool
brew "tree" # file tree viewer
brew "tree-sitter" # code parser
brew "trippy" # network diagnostic tool
brew "ugrep"
brew "gnu-units" # unit conversion tool
brew "unzip"
brew "uv" # python package manager thing?
brew "up" # live CLI pipe viewer
brew "viddy" # modern `watch` command
brew "watch" # exec periodically
brew "wget"
brew "yarn"
brew "yazi" # terminal file manager
brew "yq" # YAML parser
brew "zellij" # fancy tmux thing
brew "zenith" # fancy HTOP thing
brew "zip"
brew "zlib"
brew "zizmor"              # GitHub Actions security linter
brew "zoxide" # fancy `cd` tool
brew "zsh"
brew "xz"

# CASKS

cask "1password"
cask "1password-cli"
cask "activitywatch" # cool local-only activity time tracker
cask "alacritty" # terminal emulator
cask "android-platform-tools" # android tools
cask "appcleaner" # super-delete apps tool
cask "balenaetcher" # USB iso flasher
cask "brave-browser" # browser
cask "bruno" # API testing tool
cask "chromedriver" # remote control chrome (integ test thing)
cask "cyberduck"           # FTP/cloud storage browser
# cask "darktable" # open-source Lightroom alternative
cask "dbeaver-community" # Database query tool
cask "docker-desktop"
cask "discord" # chat
cask "element" # chat
cask "figma" # design tool
cask "finch" # Docker alternative
cask "firefox" # browser
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono-nerd-font" # <- most used font currently
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"          # GitHub's variable-width coding font
cask "font-mononoki-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "fork" # awesome git tool
cask "ghostty" # <- most used terminal emulator
cask "gimp"                # image editor
cask "hammerspoon" # shortcut creator? Haven't used much.
cask "iterm2" # terminal emulator
cask "jetbrains-toolbox" # install all the Jetbrains stuff
cask "kap" # screen-cap utility
cask "karabiner-elements" # keyboard remapping tool
cask "kitty"               # terminal emulator
cask "microsoft-edge" # browser
cask "obs" # streaming software
cask "obsidian" # note taking stuff
cask "postman" # api testing tool
cask "raspberry-pi-imager" # create images for pi
cask "raycast" # <- replace default Spotlight search :thumbs_up:
cask "rectangle" # Screen snapping shortcut tool
cask "scroll-reverser" # Reverse scroll on trackpad vs mouse
cask "spotify" # music
cask "stretchly" # get up and look away from screen periodically
cask "sublime-text" # text editor
cask "warrensbox/tap/tfswitch" # switch Terraform versions based on project
cask "tuist" # iOS project helper thing
cask "visual-studio-code" # code editor
cask "visualvm" # JVM debugging tool
cask "vlc" # play any content ever
cask "wezterm" # terminal emulator (2nd place to Ghostty right now)
cask "xcodes-app"          # GUI for xcodes
cask "zed" # cool editor, but not quite there

# VSCODE plugins

vscode "amazonwebservices.aws-toolkit-vscode"
vscode "castwide.solargraph"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "redhat.vscode-yaml"
vscode "yoavbls.pretty-ts-errors"
